# Pandas

- Alta performance e fácil uso para trabalhar com dados
- Tem muitas coisas que lembram o Excel
- O DataFrame é usado em várias outras bibliotecas de Ciência de Dados
- https://pandas.pydata.org/
<br><br>
- O Pandas vai <font color="blue">**desde a importação da base, passando por toda a análise exploratória até a exibição de gráficos** </font>

In [1]:
# Importando o pandas
import pandas as pd

### Conseguimos importar praticamente todas as bases de dados usando o pandas

**Importar uma base em csv:** <br>
<font color="blue">**pd.read_csv(**</font>"arquivo_excel.xlsx"<font color="blue">**)**</font>
- O arquivo que vamos usar é o `titanic_train.csv`

In [3]:
# Importando a base em csv
base = pd.read_csv('titanic_train.csv')

### E também visualizar todas as informações sobre essa base

In [4]:
# Visualizando as 5 primeiras linhas
base.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# Visualizando as 5 últimas linhas
base.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
# Tamanho da base
base.shape

(891, 12)

In [10]:
# Visualizando primeiras e últimas linhas e tamanho da base
display(base)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Além disso, também podemos ver as informações da base

In [11]:
# Mostrando somente o tipo dos dados
base.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [30]:
# Mostrando o tipo de dados e os valores vazios

In [31]:
# Contando os valores vazios por coluna

### Principais conceitos estatísticos

In [ ]:
dados = {
    'X': [1,2,3] #,4,5,6,7,8,9,10,11]
}

dados = pd.DataFrame(dados)

In [32]:
# Mostrando a média

In [33]:
# Mostrando a contagem de registros

In [34]:
# Mediana

In [35]:
# Desvio Padrão

In [36]:
# Trazendo todo o resumo estatístico utilizando o describe

**Voltando para a base do nosso problema**

In [ ]:
# Trazendo o resumo estatístico para a nossa base

### Escolhendo colunas da base

**Buscando por uma coluna:** <br>

In [37]:
# Podemos usar o nome da coluna entre aspas

In [38]:
# Ou usar o ponto

In [39]:
# Usando uma coluna, podemos contar a quantidade de vezes que cada valor aparece

In [40]:
# Selecionando um conjunto de colunas

### Também conseguimos fazer filtros na base

In [ ]:
# Visualizando novamente na base

In [ ]:
# Verificando clientes que pagaram mais de 100 libras

In [ ]:
# Verificando se tiveram clientes que pagaram menos de 5 euros

**Podemos fazer filtros usando E / OU**

In [ ]:
# Verificando se alguém viajou com esposa E filhos

#### Uma forma muito útil de fazer seleção de dados é usando o <font color="blue">.loc()</font> ou o <font color="blue">.iloc()</font>

In [ ]:
# O .loc() permite fazer a busca da mesma forma acima

In [ ]:
# Ele também permite usar argumentos lógicos

In [ ]:
# Ele permite filtrar colunas de forma muito prática

**Já o <font color="blue">.iloc() </font> vai usar o índice para filtrar**

In [ ]:
# Buscando as linhas de 30 (inclusive) a 40 (exclusive)

In [ ]:
# Também posso usar para buscar apenas colunas específicas

### Por fim, conseguimos fazer gráficos com o Pandas de forma bem simples

- https://pandas.pydata.org/docs/user_guide/visualization.html

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
# É possível fazer um histograma simples

In [ ]:
# Gráficos de barras

In [ ]:
# E até gráficos mais complexos como o de densidade